argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
const char* sd_log_filename = "sdlog.BIN";

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
extern "C" void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_CRC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_USART1_UART_Init(void);
extern void GRAPHICS_HW_Init(void);
extern void GRAPHICS_Init(void);
extern void GRAPHICS_MainTask(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_RNG_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);
void StartButtonTask(void const * argument);
void StartLEDTask(void const * argument);
void StartSDTask(void const * argument);

/* USER CODE BEGIN PFP */
void Start_HTTP_Client_Task(void const * argument);
void Start_HTTP_Server_Task(void const * argument);

#if (CLI_USE_FREERTOS_QUEUE == 1)
void Start_CLI_Logger_Task(void const * argument);
#endif

uint16_t cli_dump(const char* src, uint16_t len);
uint16_t cli_write(const char* src, uint16_t len);

void http_print_msg(lwhttp_message_t* msg);

static BaseType_t jsoneq(const char *json, const jsmntok_t * const pxTok, const char *s);

BaseType_t post_thingspeak(lwhttp_request_t* req_ptr, lwhttp_response_t* rsp_ptr, uint8_t data);
BaseType_t parse_thingspeak_rsp(char* src, uint16_t len);

FRESULT sd_scan_files(char* path);
FRESULT sd_get_free_clusters(FATFS* fs);

FRESULT sd_log(uint32_t data);
FRESULT sd_log_append(sd_log_entry_t* xLogEntry);
FRESULT sd_log_dump(void);
FRESULT sd_log_clear(void);
void sd_log_entry_print(sd_log_entry_t* xLogEntry);

FRESULT sd_log_header_write(FIL* fp, sd_log_header_t* xHeader);
FRESULT sd_log_header_read(FIL* fp, sd_log_header_t* xLogHeader);
FRESULT sd_log_header_verify(FIL* fp, sd_log_header_t* xHeader);
FRESULT sd_log_entry_write(FIL* fp, sd_log_entry_t* xLogEntry, uint32_t ulID);
FRESULT sd_log_entry_read(FIL* fp, sd_log_entry_t* xLogEntry, uint32_t ulID);
FRESULT sd_log_entry_set_sent(uint32_t ulID);
FRESULT sd_log_entry_get_pending(sd_log_entry_t* pxEntry);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern struct netif gnetif;
extern ip4_addr_t ipaddr;

char ip4_addr_str[IP4ADDR_STRLEN_MAX];
char* ip4_addr_ptr = &ip4_addr_str[0];
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_CRC_Init();
  MX_I2C1_Init();
  MX_I2C3_Init();
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_USART1_UART_Init();
  MX_SDMMC1_SD_Init();
  MX_RNG_Init();
  MX_USART6_UART_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

/* Initialise the graphical hardware */
  GRAPHICS_HW_Init();

  /* Initialise the graphical stack engine */
  GRAPHICS_Init();
      
  

  /* USER CODE BEGIN RTOS_MUTEX */
    /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* definition and creation of cliBinarySem */
  osSemaphoreDef(cliBinarySem);
  cliBinarySemHandle = osSemaphoreCreate(osSemaphore(cliBinarySem), 1);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
    /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
    /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 4);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

#if (CLI_USE_FREERTOS_QUEUE == 1)
  /* definition and creation of CLILoggerTask */
  osThreadDef(CLILoggerTask, Start_CLI_Logger_Task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  CLILoggerTaskHandle = osThreadCreate(osThread(CLILoggerTask), NULL);
#endif

  /* definition and creation of buttonTask */
  osThreadDef(buttonTask, StartButtonTask, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  buttonTaskHandle = osThreadCreate(osThread(buttonTask), NULL);

  /* definition and creation of ledTask */
  osThreadDef(ledTask, StartLEDTask, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 4);
  ledTaskHandle = osThreadCreate(osThread(ledTask), NULL);

  /* definition and creation of sdTask */
  osThreadDef(sdTask, StartSDTask, osPriorityAboveNormal, 0, configMINIMAL_STACK_SIZE * 8);
  sdTaskHandle = osThreadCreate(osThread(sdTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
    /* add threads, ... */

  /* definition and creation of httpClientTask */
  osThreadDef(httpClientTask, Start_HTTP_Client_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 8);
  httpClientTaskHandle = osThreadCreate(osThread(httpClientTask), (void*)&gnetif);
  
  /* USER CODE END RTOS_THREADS */

  /* Create the queue(s) */
  /* definition and creation of buttonQueue */
  osMessageQDef(buttonQueue, 16, uint8_t);
  buttonQueueHandle = osMessageCreate(osMessageQ(buttonQueue), NULL);

  /* definition and creation of ledQueue */
  osMessageQDef(ledQueue, 16, uint8_t);
  ledQueueHandle = osMessageCreate(osMessageQ(ledQueue), NULL);

  /* definition and creation of tcpQueue */
  osMessageQDef(tcpQueue, 8, uint16_t);
  tcpQueueHandle = osMessageCreate(osMessageQ(tcpQueue), NULL);

  /* definition and creation of logQueue */
  osMessageQDef(logQueue, 8, uint16_t);
  logQueueHandle = osMessageCreate(osMessageQ(logQueue), NULL);

  /* definition and creation of dumpQueue */
  osMessageQDef(dumpQueue, 8, uint16_t);
  logDumpQueueHandle = osMessageCreate(osMessageQ(dumpQueue), NULL);

  /* definition and creation of clearQueue */
  osMessageQDef(clearQueue, 8, uint16_t);
  logClearQueueHandle = osMessageCreate(osMessageQ(clearQueue), NULL);

  /* definition and creation of sentQueue */
  osMessageQDef(sentQueue, 8, uint16_t);
  logSentQueueHandle = osMessageCreate(osMessageQ(sentQueue), NULL);

  /* definition and creation of getIPQueue */
  osMessageQDef(getIPQueue, 1, uint16_t);
  getIPQueueHandle = osMessageCreate(osMessageQ(getIPQueue), NULL);

  /* definition and creation of setIPQueue */
  osMessageQDef(setIPQueue, 1, char*);
  setIPQueueHandle = osMessageCreate(osMessageQ(setIPQueue), NULL);

  /* USER CODE BEGIN RTOS_QUEUES */
    /* add queues, ... */
  /* definition and creation of cliLoggerQueue */
  osMessageQDef(cliLoggerQueue, 32, char**);
  cliLoggerQueueHandle = osMessageCreate(osMessageQ(cliLoggerQueue), NULL);
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

