argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
          /* Close & Delete connection */
          netconn_close(newconn);
          netconn_delete(newconn);
        
          /* Print HTTP Request */
          lwhttp_request_get_request_line(&server_request, &temp_buf_data, &temp_buf_data_len);
          cli_printf("[LwHTTP] Request-Line: %.*s\r\n", temp_buf_data_len, temp_buf_data);
          
          /* Print HTTP Response */
          lwhttp_response_parse(&server_response);
          lwhttp_response_get_status_line(&server_response, &temp_buf_data, &temp_buf_data_len);
          cli_printf("[LwHTTP] Status-Line: %.*s\r\n\r\n", temp_buf_data_len, temp_buf_data);
            
          /* Free LwHTTP Request & Response */
          lwhttp_request_free(&server_request);
          lwhttp_response_free(&server_response);
        }
        
        osDelay(10);
      }
    }
  }

  /* USER CODE END Start_HTTP_Server_Task */
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  RTOS_TASK_START();  

  /* Graphic application */  
  GRAPHICS_MainTask();
      
  /* USER CODE BEGIN 5 */

  RTOS_TASK_READY();

  /* Infinite loop */
  for (;;)
  {
      osDelay(10);
  }
  /* USER CODE END 5 */ 
}

/* USER CODE BEGIN Header_StartButtonTask */
/**
* @brief Function implementing the buttonTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartButtonTask */
void StartButtonTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartButtonTask */
  uint32_t buttonState = 0;
  uint8_t buttonCount = 0;
  
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
  
  RTOS_TASK_READY();
  /* Infinite loop */
  for(;;)
  {
    buttonState = BSP_PB_GetState(BUTTON_KEY);
    if (buttonState == 1)
    {
      if(xQueueSend(buttonQueueHandle, (uint8_t*)&buttonState, 0) == pdTRUE)
      {
        DBG_QUEUE("buttonQueueHandle: %d\r\n", buttonCount++);
      }
    }
    
    osDelay(10);
  }
  /* USER CODE END StartButtonTask */
}

/* USER CODE BEGIN Header_StartLEDTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLEDTask */
void StartLEDTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartLEDTask */
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);  
      
  RTOS_TASK_READY();
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(ledQueueHandle, &led_state, 0) == pdTRUE)
    {
      DBG_QUEUE("ledQueueHandle: %d\r\n", led_state);
      if (led_state == 1)
      {
        BSP_LED_On(LED_GREEN);
      }
      else
      {
        BSP_LED_Off(LED_GREEN);
      }
    }

    osDelay(10);
  }
  /* USER CODE END StartLEDTask */
}

FRESULT sd_log(uint32_t ulData)
{
  FRESULT fr;
  
  sd_log_entry_t xLogEntry = {
    .ulID = 0xFFFFFFFF,
    .ulData = ulData,
    .ucStatus = SD_LOG_PENDING
  };

  fr = sd_log_append(&xLogEntry);
  if (fr == FR_OK)
  {
    sd_log_entry_print(&xLogEntry);
  }
  else
  {
    DBG_FATFS("sd_append (fr = %d)\r\n",  fr);
  }

  return fr;
}

void sd_log_entry_print(sd_log_entry_t* xLogEntry)
{
  if (xLogEntry != NULL)
  {
    DBG_FATFS("Log entry [0x%04X] Status = %d, Data = %d\r\n", 
      xLogEntry->ulID, 
      xLogEntry->ucStatus, 
      xLogEntry->ulData
    );
  }
}

void sd_log_header_print(sd_log_header_t* xLogHeader)
{
  if (xLogHeader != NULL)
  {
    DBG_FATFS("Log header: Count = %d, Pending = %d, Index = %d\r\n", 
      xLogHeader->ulCount, 
      xLogHeader->ulPending, 
      xLogHeader->ulIndex
    );
  }
}

FRESULT sd_log_entry_get_pending(sd_log_entry_t* pxEntry)
{
  FRESULT fr;                                 /* FatFs function common result code */
  FIL fil;                                    /* File object */
  uint32_t ulLogIndex = 0;
  sd_log_header_t xLogHeader;

  /* Open log file */
  fr = f_open(&fil, (char*)sd_log_filename, FA_OPEN_ALWAYS | FA_WRITE | FA_READ);
  if(fr == FR_OK)
  {
    /* Check log file integrity */
    fr = sd_log_header_verify(&fil, &xLogHeader);
    if (FR_OK == fr)
    {
      /* If there are pending log entries */
      if (0 < xLogHeader.ulPending)
      {
        for (ulLogIndex = xLogHeader.ulIndex; ulLogIndex < xLogHeader.ulCount; ulLogIndex++)
        {
          /* Read entry */
          fr = sd_log_entry_read(&fil, pxEntry, ulLogIndex);
          if (fr == FR_OK)
          {
            /* If current entry is pending, end the loop */
            if (pxEntry->ucStatus == SD_LOG_PENDING)
            {
              /* Update header search index */
              xLogHeader.ulIndex = pxEntry->ulID;
              fr = sd_log_header_write(&fil, &xLogHeader);
              DBG_FATFS("Log Entry Pending: ID = %d\r\n", pxEntry->ulID);
              break;
            }
            else
            {
              /* Error, entry already sent */
              fr = FR_DENIED;
            }
          }
        }
      }
      else
      {
        fr = FR_DENIED;
      }
    }
    else
    {
      DBG_FATFS("fr = %d\r\n", fr);
    }

    f_close(&fil);
  }
  else
  {
    DBG_FATFS("f_open (fr = %d)\r\n",  fr);
  }
  
  return fr;
}

FRESULT sd_log_entry_set_sent(uint32_t ulID)
{
  FRESULT fr;                                    /* FatFs function common result code */
  FIL fil;                                       /* File object */
  sd_log_header_t xLogHeader;
  sd_log_entry_t xLogEntry;

  /* Open log file */
  fr = f_open(&fil, (char*)sd_log_filename, FA_OPEN_ALWAYS | FA_WRITE | FA_READ);
  if(fr == FR_OK)
  {
    /* Check log file integrity */
    fr = sd_log_header_verify(&fil, &xLogHeader);
    if (fr == FR_OK)
    {      
      /* Check if ID exists */
      if (ulID <= xLogHeader.ulCount)
      {
        /* Read entry */
        fr = sd_log_entry_read(&fil, &xLogEntry, ulID);
        if(fr == FR_OK)
        {
          /* ID Matches and not already marked as sent */
          if ((xLogEntry.ulID == ulID) && (xLogEntry.ucStatus == 0))
          {
            /* Mark as sent */
            xLogEntry.ucStatus = SD_LOG_SENT;

            /* Save the changes */
            fr = sd_log_entry_write(&fil, &xLogEntry, xLogEntry.ulID);
            if(fr == FR_OK)
            {
              /* Save header changes */
              xLogHeader.ulPending--;
              fr = sd_log_header_write(&fil, &xLogHeader);
              DBG_FATFS("Log Entry Sent: ID = %d\r\n", xLogEntry.ulID);
            }
          }
          else
          {
            /* Do nothing, was already marked as sent */
          }
        }
      }
      else
      {
        /* Invalid ID */
        fr = FR_DENIED;
      }
    }
    else
    {
      DBG_FATFS("fr = %d\r\n", fr);
    }

    f_close(&fil);
  }
  return fr;
}

FRESULT sd_log_header_write(FIL* fp, sd_log_header_t* xHeader)
{
  FRESULT fr;  
  uint32_t ulBytesWritten = 0;

  fr = f_lseek(fp, 0);
  if(fr == FR_OK)
  {
    fr = f_write(fp, (void*)xHeader, SD_LOG_HEADER_SIZE, (UINT *)&ulBytesWritten);
    if (fr == FR_OK)
    {
      if (ulBytesWritten != SD_LOG_HEADER_SIZE)
      {
        fr = FR_DENIED;
        DBG_FATFS("fr = %d, size mismatch (%ld != %ld)\r\n", fr, ulBytesWritten, SD_LOG_HEADER_SIZE);
      }
      
