argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
      f_sync(fp);    
    }
    else
    {
      DBG_FATFS("f_write (fr = %d)\r\n",  fr);
    }
  }
  else 
  {
    DBG_FATFS("f_lseek (fr = %d)\r\n",  fr);
  }

  return fr;
}

FRESULT sd_log_header_read(FIL* fp, sd_log_header_t* xLogHeader)
{
  FRESULT fr = FR_OK;  
  uint32_t ulBytesRead = 0;                   /* File write/read counts */

  fr = f_lseek(fp, 0);
  if(fr == FR_OK)
  {
    fr = f_read(fp, (void*)xLogHeader, SD_LOG_HEADER_SIZE, (UINT *)&ulBytesRead);
    if (fr == FR_OK)
    {
      if (ulBytesRead != SD_LOG_HEADER_SIZE)
      {
        fr = FR_DENIED;
        DBG_FATFS("fr = %d, size mismatch (%ld != %ld)\r\n", fr, ulBytesRead, SD_LOG_HEADER_SIZE);
      }
    }
    else
    {
      DBG_FATFS("f_read (fr = %d)\r\n",  fr);
    }
  }
  else 
  {
    DBG_FATFS("f_lseek (fr = %d)\r\n",  fr);
  }

  return fr;
}

FRESULT sd_log_entry_write(FIL* fp, sd_log_entry_t* xLogEntry, uint32_t ulID)
{
  FRESULT fr;  
  uint32_t ulBytesWritten = 0;                   /* File write/read counts */
  uint32_t ulOffset = 0;

  if (0xFFFFFFFF == ulID)
  {
    ulOffset = f_size(fp);
  }
  else
  {
    ulOffset = (uint32_t)(SD_LOG_HEADER_SIZE + (SD_LOG_ENTRY_SIZE * ulID));
  }

  fr = f_lseek(fp, ulOffset);
  if(fr == FR_OK)
  {
    fr = f_write(fp, (void*)xLogEntry, SD_LOG_ENTRY_SIZE, (UINT *)&ulBytesWritten);
    if (fr != FR_OK)
    {
      if (ulBytesWritten != SD_LOG_ENTRY_SIZE)
      {
        fr = FR_DENIED;
        DBG_FATFS("fr = %d, size mismatch (%ld != %ld)\r\n", fr, ulBytesWritten, SD_LOG_HEADER_SIZE);
      }
    }
    else
    {
      DBG_FATFS("f_write (fr = %d)\r\n",  fr);
    }
    f_sync(fp);
  }
  else 
  {
    DBG_FATFS("f_lseek (fr = %d)\r\n",  fr);
  }

  return fr;
}

FRESULT sd_log_entry_read(FIL* fp, sd_log_entry_t* xLogEntry, uint32_t ulID)
{
  FRESULT fr;  
  uint32_t ulBytesRead = 0;                   /* File write/read counts */

  fr = f_lseek(fp, SD_LOG_HEADER_SIZE + (SD_LOG_ENTRY_SIZE * ulID));
  if(fr == FR_OK)
  {
    fr = f_read(fp, (void*)xLogEntry, SD_LOG_ENTRY_SIZE, (UINT *)&ulBytesRead);
    if (fr == FR_OK)
    {
      if (ulBytesRead != SD_LOG_ENTRY_SIZE)
      {
        fr = FR_DENIED;
        DBG_FATFS("fr = %d, size mismatch (%ld != %ld)\r\n", fr, ulBytesRead, SD_LOG_HEADER_SIZE);
      }
    }
    else
    {
      DBG_FATFS("f_read (fr = %d)\r\n",  fr);
    }
  }
  else 
  {
    DBG_FATFS("f_lseek (fr = %d)\r\n",  fr);
  }

  return fr;
}

FRESULT sd_log_append(sd_log_entry_t* xLogEntry)
{
  FRESULT fr;                                    /* FatFs function common result code */
  FIL fil;                                       /* File object */
  sd_log_header_t xLogHeader;

  /* Open log file */
  fr = f_open(&fil, (char*)sd_log_filename, FA_OPEN_ALWAYS | FA_WRITE | FA_READ);
  if(fr == FR_OK)
  {
    fr = sd_log_header_verify(&fil, &xLogHeader);
    if (fr == FR_OK)
    {
      /* Add ID */
      xLogEntry->ulID = xLogHeader.ulCount;

      /*##-5- Write data to the text file ################################*/
      fr = sd_log_entry_write(&fil, xLogEntry, 0xFFFFFFFF);
      if (fr == FR_OK)
      {
        xLogHeader.ulCount++;
        xLogHeader.ulPending++;

        fr = sd_log_header_write(&fil, &xLogHeader);
      }
    }
    else
    {
      DBG_FATFS("fr = %d\r\n", fr);
    }

    /*##-6- Close the open text file #################################*/
    f_close(&fil);
  }
  else
  {
    DBG_FATFS("f_open (fr = %d)\r\n",  fr);
  }
  
  return fr;
}

FRESULT sd_log_clear(void)
{
  return f_unlink( (char*)sd_log_filename );
}

FRESULT sd_log_header_verify(FIL* fp, sd_log_header_t* xHeader)
{
  FRESULT fr;                                 /* FatFs function common result code */
  uint32_t ulFileSize = 0;
  uint32_t ulLogEntries = 0;

  ulFileSize = f_size(fp);

  if (0 == ulFileSize)
  {
    xHeader->ulCount = 0;
    xHeader->ulPending = 0;
    xHeader->ulIndex = 0;
    fr = sd_log_header_write(fp, xHeader);
  }
  else
  {
    if (((ulFileSize - SD_LOG_HEADER_SIZE) % SD_LOG_ENTRY_SIZE) == 0)
    {
      ulLogEntries = (uint32_t) ((ulFileSize - SD_LOG_HEADER_SIZE) / SD_LOG_ENTRY_SIZE);
      fr = sd_log_header_read(fp, xHeader);
      if (fr == FR_OK)
      {
        if (xHeader->ulCount == ulLogEntries)
        {
          fr = FR_OK;
        }
        else
        {
          fr = FR_DENIED;
          DBG_FATFS("Header count mismatch (%d != %d)\r\n", xHeader->ulCount, ulLogEntries);
        }
      }
      else
      {
        DBG_FATFS("fr = %d\r\n", fr);
      }
    }
    else
    {
      fr = FR_DENIED;
      DBG_FATFS("File size = %d\r\n",  ulFileSize);
    }
  }

  return fr;
}

FRESULT sd_log_dump(void)
{
  FRESULT fr;                                 /* FatFs function common result code */
  FIL fil;                                    /* File object */
  uint32_t ulFileSize = 0;
  uint32_t ulBytesRead = 0;
  uint32_t ulLogIndex = 0;
  sd_log_header_t xLogHeader;
  sd_log_entry_t xLogEntry;

  DBG_FATFS("File name = %s\r\n",  (char*)sd_log_filename);

  /*##-7- Open the text file object with read access ###############*/
  fr = f_open(&fil, (char*)sd_log_filename, FA_OPEN_ALWAYS | FA_READ | FA_WRITE);
  if(fr == FR_OK)
  {
    DBG_FATFS("File size = %d bytes\r\n", f_size(&fil));

    fr = sd_log_header_verify(&fil, &xLogHeader);
    if (FR_OK == fr)
    {
      sd_log_header_print(&xLogHeader);

      for (ulLogIndex = 0; ulLogIndex < xLogHeader.ulCount; ulLogIndex++)
      {
        /*##-8- Read data from the text file ###########################*/
        fr = sd_log_entry_read(&fil, &xLogEntry, ulLogIndex);
        if (fr == FR_OK)
        {
          sd_log_entry_print(&xLogEntry);
          osDelay(10);
        }
        else 
        {
          DBG_FATFS("f_read (fr = %d)\r\n",  fr);
        }        
      }
    }
    else
    {
      DBG_FATFS("fr = %d\r\n", fr);
    }

    f_close(&fil);
  }
  else
  {
    DBG_FATFS("f_open (fr = %d)\r\n",  fr);
  }
  
  return fr;
}

/* USER CODE BEGIN Header_StartSDTask */
/**
* @brief Function implementing the sdTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSDTask */
void StartSDTask(void const * argument)
{
  RTOS_TASK_START();  

  /* USER CODE BEGIN StartSDTask */
  FRESULT fr;                                 /* FatFs function common result code */
  FATFS* fs = &SDFatFs;                       /* File system object for SD card logical drive */
  uint8_t ret = 0;
  uint32_t rng_value = 0;

  uint8_t state = 0;
  uint8_t state_new = 0;

  /* Queue PV */
  uint8_t queueData = 0;

  /* init code for FATFS */
  MX_FATFS_Init();

  RTOS_TASK_READY();

