argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
  /* Infinite loop */
  for(;;)
  {
    if (state != state_new)
    {
      DBG_FATFS("State transition (%d >> %d)\r\n", state, state_new);
      state = state_new;
    }

    switch(state){
      case 0:
      {
        /*##-1- Link the micro SD disk I/O driver ##################################*/
        ret = BSP_SD_Init();
        if(ret == MSD_OK)
        {
          /*##-2- Register the file system object to the FatFs module ##############*/
          fr = f_mount(fs, (TCHAR const*)SDPath, 0);
          if(fr != FR_OK)
          {
            DBG_FATFS("f_mount (fr = %d)\r\n",  fr);
          }
          else
          {
            state_new = 1;
          }
        }
        else
        {
          DBG_FATFS("BSP_SD_Init (ret = %d)\r\n",  ret);
        }
      }
      break;
      case 1:
      {
        /* Idle */
      }
      break;
      break;
      default:
      break;
    }

    if(xQueueReceive(logQueueHandle, &queueData, 0) == pdTRUE)
    {
      // DBG_QUEUE("logQueueHandle: %d\r\n", queueData);
#if 1      
      /* Get random number */
      HAL_RNG_GenerateRandomNumber(&hrng, &rng_value);

      /* Add to file */
      fr = sd_log((uint32_t)(rng_value % 40));
#else
      fr = sd_log((uint32_t)queueData);
#endif
      if(fr != FR_OK)
      {
        DBG_FATFS("sd_log failed = %d\r\n", fr);
        state_new = 0;
      }
    }
    else if(xQueueReceive(logDumpQueueHandle, &queueData, 0) == pdTRUE)
    {
      // DBG_QUEUE("logDumpQueueHandle\r\n");
      fr = sd_log_dump();
      if(fr != FR_OK)
      {
        DBG_FATFS("sd_log failed = %d\r\n", fr);
        state_new = 0;
      }
    }
    else if(xQueueReceive(logSentQueueHandle, &queueData, 0) == pdTRUE)
    {
      DBG_QUEUE("logSentQueueHandle\r\n");
      /* Get random number */
      sd_log_entry_t xEntry;

      if (FR_OK == sd_log_entry_get_pending(&xEntry))
      {
        if(FR_OK != sd_log_entry_set_sent(xEntry.ulID))
        {
          DBG_FATFS("sd_log_entry_set_sent failed = %d\r\n", fr);
          state_new = 0;
        }
      }

    }
    else if(xQueueReceive(logClearQueueHandle, &queueData, 0) == pdTRUE)
    {
      // DBG_QUEUE("logClearQueueHandle\r\n");
      fr = sd_log_clear();
      if(fr != FR_OK)
      {
        DBG_FATFS("sd_log_clear failed = %d\r\n", fr);
        state_new = 0;
      }
    }

    osDelay(100);
  }

  /* USER CODE END StartSDTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
